<a href="https://colab.research.google.com/github/jeshuacn/curso-algebra-lineal/blob/master/Copy_of_Read__Introduction_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction
 
SQL stands for Structured Query Language, which is an ANSI ( American National Standards Institute ) standard language. Relational Database System uses SQL for storing, manipulating, and retrieving data stored in a relational database.

SQL is the standard database language for Relational Database Management Systems (RDMS), such as MySQL, MS Access, Oracle, Sybase, Informix, Postgres, and SQL Server. RDMS are using different version like:
- MS SQL Server using T-SQL
- Oracle using PL/SQL
- MS Access version of SQL is called JET SQL

## **SQL Process**

In RDBMS, the system determines the most efficient path to carry out the SQL command request, and SQL engine finds how to interpret the task.

### SQL Process Architecture


![SQL Process Architecture](https://drive.google.com/uc?export=view&id=1a7e5wcJ6zjuIdhjOp-3CWVLXV3LHexx7)

Figure: Overview of SQL Processing

### Different Stages of SQL Processing
![SQL Process Architecture](https://drive.google.com/uc?export=view&id=1qH4A2Qj902fq76vpYporDSjSXgaUqUeK)

Figure: Stages of SQL Processing

### SQL Parsing
The parsing stage involves separating the pieces of a SQL statement into a data structure that other routines can process. When an application issues a SQL statement, the application makes a parse call to the database to prepare the statement for execution. The parse call creates a **cursor**, which is a handle for the session-specific **private SQL area** that holds a parsed SQL statement and other processing information.

During parse call, the database performs the following checks:
- **Syntax Check**: A statement that breaks a rule for well-formed SQL syntax fails the check.
- **Semantic Check**: It determines whether a statement is meaningful or not.
- **Shared Pool Check**: It determines whether it can skip resource-intensive steps of statement processing.

*Hard parse: The operation where the database cannot reuse existing code, then it must build a new executable version of the application code.

*Soft parse: The process, also called library cache hit, which reuses the existing code when the submitted statement is the same as a reusable SQL statement in the shared pool.

### SQL Optimization
The database must perform a hard parse at least once for every unique DML statement and performs the optimization during this parse. The **row source generator** is software that receives the optimal execution plan from the optimizer and produces an iterative execution plan that is usable by the rest of the database.

The iterative plan is a binary program that, when executed by the SQL engine, produces the result set. The plan takes the form of a combination of steps. Each step returns a row set. The next step either uses the rows in this set, or the last step returns the rows to the application issuing the SQL statement.

### SQL Execution

The SQL engine executes each row source in the tree produced by the row source generator. This step is the only mandatory step in DML processing. Each step in an execution plan has an ID number. Initial spaces in the Operation column of the plan indicate hierarchical relationships. For example, if two spaces precede the name of an operation, then this operation is a child of an operation preceded by one space.

## **Several parts of SQL language**
###  **Data Definition Language:** 
The subset of SQL commands that modify the actual structure of a database, rather than the database's contents. The most important DDL statements in SQL are:
* CREATE - creates a new database table
* ALTER  - alters (changes) a database table
* DROP   - deletes a database table


### **Data Manipulation Language:** 
Those SQL commands that change the contents of a database in some form. The most important DML statements in SQL are:
* SELECT - extracts data from a database table
* UPDATE - updates data in a database table
* DELETE - deletes data from a database table
* INSERT INTO - inserts new data into a database table


### **Data Control Language (DCL):**
DCL manages user access to the database. It consists of two commands:
* GRANT – Gives user's access privileges to database
* REVOKE – Withdraws user's access privileges to database given with the GRANT command

### **Fuse AI Database**


![FuseAI Database](https://drive.google.com/uc?export=view&id=1u-sN7Rcxmf0ea0gEWw5GVMZW4XglZqqJ)

## **Some Terminologies**

### **SQL Constraint**
Constraints are the rules enforced on the data columns of a table. These limit the type of data that can go into a table. As a result, it ensures the accuracy and reliability of the data in the database.
Constraints could be either on a **column level** or a **table level**. The column level constraints are applied only to one column, whereas the table level constraints are applied to the whole table.

### **Dropping Constraints**
These define the constraints that can be dropped using the ALTER TABLE command with the DROP CONSTRAINT option. It is one of the table-level constraints.

### **Integrity Constraints**
Integrity constraints ensure that changes made to the database by authorized users do not result in loss of data consistency. For example: NOT NULL, PRIMARY KEY(Attribute1, Attribute2, ..., AttributeN), FOREIGN KEY(Attribute1, Attribute2, ..., AttributeN) references. It is one of the column level constraints.

### **Types of Integrity constraints**
![Types of Integrity constraints](https://drive.google.com/uc?export=view&id=1D0Ve306_UfiQxSugPNfkGN5JSTQxYTAs)

Figure: Types of Integrity constraints

#### **Domain Constraints**
A domain of possible values must be associated with every attribute in the database. Declaring an attribute of a particular domain acts as a restraint on the values it can take. The system easily tests them. For instance, you cannot set an integer value to "user_name".The data type of domain includes string, character, integer, time, date, currency, etc. The value of the attribute must be available in the corresponding domain.

#### **Data Integrity**
We need to make sure that the data present in the database is correct and consistent. This is known as data integrity. For relational databases, there are entity integrity and referential integrity rules which help to make sure that we have data integrity.

#### **Entity Integrity**
The entity integrity rule applies to Primary Keys. The entity integrity rule says that the value of a Primary Key in a table must be unique, and it can never have any value (null). Operations on the database which insert new data, update existing data or delete data must follow this rule.

#### **Referential Integrity Constraints**
A referential integrity constraint is specified between two tables, where if a foreign key in Table 1 refers to the Primary Key of Table 2, then every value of the Foreign Key in Table 1 must be null or be available in Table 2.

#### **Key constraints**
Keys are the entity set that identifies an entity within its entity set uniquely, and it can have multiple keys, but out of which one key is the primary key. A primary key can contain a unique and null value in the relational table.

## **Data Definition Language**
Data Definition Language Commands allow the user to define, delete, and modify relations, which includes specifying the schema for each relation, the domain of value associated with each attribute, integrity constraints, and other information related to relationships.


> Domain Types in SQL

<table>
<thead>
<tr>
<th>Domain Type</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td>Char (n)</td>
<td>Fixed length character string, with user-specified length n.</td>
</tr>
<tr>
<td>Varchar(n)</td>
<td>Variable length character strings, with user-specified maximum length n.</td>
</tr>
<tr>
<td>int</td>
<td>Integer</td>
</tr>
<tr>
<td>Numeric (p,d)</td>
<td>Fixed point number, with user-specified precision of p digits, with n digits to the right of decimal point. <br/>
Example: numeric(4,2) allows 44.77 to be stored exactly, but not 447.7 or 0.47)</td>
</tr>
<tr>
<td>Float (n)</td>
<td>Floating point number, with user-specified precision of at least n digits.</td>
</tr>
<tr>
<td>timestamp</td>
<td>Date plus time of day. <br/> Eg. Example: timestamp NOW()</td>
</tr>
</tbody>
</table>

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://

'Connected: @None'

### **Create Table Construct**

The **create table** command can be used to create tables in SQL. The **create table** command is defined as:
```
create table <relation_name>(
	<attribute_name>	<data_type>	<integrity_constraint>
	<attribute_name>	<data_type>	<integrity_constraint>
	<attribute_name>	<data_type>	<integrity_constraint>
	<integrity_constraint>
);
```

> Example: Create student and course table

```
CREATE TABLE student(
	    student_id      INT NOT NULL PRIMARY KEY auto_increment,
    	student_name    VARCHAR(50) NOT NULL,
    	student_email   VARCHAR(50),
    	student_contact VARCHAR(15),
    	date_joined     TIMESTAMP DEFAULT NOW()
);

CREATE TABLE course(
	    course_id       INT NOT NULL PRIMARY KEY auto_increment,
    	course_name     VARCHAR(50) NOT NULL,
    	course_length   INT
);
```

In [ ]:
%%sql
CREATE TABLE student(
        student_id      INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
        student_name    VARCHAR(50) NOT NULL,
        student_email   VARCHAR(50),
        student_contact VARCHAR(15)
);

CREATE TABLE course(
        course_id       INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
        course_name     VARCHAR(50) NOT NULL,
        course_length   INT
);

 * sqlite://
Done.
Done.

[]




> Example: Create Enrollment Pivot Table

```
CREATE TABLE enrollment(
    student_id  INT,
    course_id   INT,
    FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE
);
```

> Example: Create Module table

```
CREATE TABLE module(
    course_id 	INT,
    module_num 	INT,
    module_name VARCHAR(50) NOT NULL,
    PRIMARY KEY(course_id,module_num),
    FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE
);
```

In [ ]:
%%sql
CREATE TABLE enrollment(
    student_id  INTEGER,
    course_id   INTEGER,
    FOREIGN KEY(student_id) REFERENCES student(student_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE
);

CREATE TABLE module(
    course_id     INTEGER,
    module_num     INTEGER,
    module_name VARCHAR(50) NOT NULL,
    PRIMARY KEY(course_id,module_num),
    FOREIGN KEY(course_id) REFERENCES course(course_id) ON DELETE CASCADE ON UPDATE CASCADE
);

 * sqlite://
Done.
Done.

[]

### **Drop and Alter Table Constructs**
The **drop table** command deletes all information about the dropped relation from the database.
The alter table command is used to alter attributes/domain/constraint to an existing relation.

* To Drop table <br/>
`Drop table <table_name>`

* To remove all tuples from the table but keep the table <br/>
`Delete from <table_name>`

* To add attributes in table<br/>
`Alter table <table_name> add <attribute_name> <data_type>`<br/>
> Example: `ALTER TABLE course ADD course_difficulty VARCHAR(10)`

* To drop attributes from table<br/>
`Alter table <table_name> Drop column <attribute_name>`

* To change the data type of a column in a table<br/>
`ALTER TABLE <table_name> ALTER COLUMN <column_name> datatype(size)`

* To Add constraint in table<br/>
`Alter table <table name> Add constraint <constraint name> <constraint type> <column_name>`

### Insert into table
`Insert into <table_name> Values('val1','val2',...,'valn')`

> Example: To insert some values in student and course table:

```
INSERT INTO student (student_name, student_email)
VALUES 
('John Doe', 'john@fusemachines.com'),
('Dummy Person', 'dummy@fusemachines.com');

INSERT INTO course (course_name,course_length)
VALUES 
('Fundamentals of Computer Science',3),
('Fundamentals of Mathematics',3),
('Machine Learning',3),
('Deep Learning',3),
('Computer Vision',3),
('Natural Language Processing',3);
```

In [ ]:
%%sql
INSERT INTO student (student_name, student_email)
VALUES 
('John Doe', 'john@fusemachines.com'),
('Dummy Person', 'dummy@fusemachines.com');

INSERT INTO course (course_name,course_length)
VALUES 
('Fundamentals of Computer Science',3),
('Fundamentals of Mathematics',3),
('Machine Learning',3),
('Deep Learning',3),
('Computer Vision',3),
('Natural Language Processing',3);

 * sqlite://
2 rows affected.
6 rows affected.

[]

## **Data Manipulation language (DML)**
### **SELECT Statement**
The SELECT statement selects data from a table. The result of the SELECT query is also a table(called the result-set). To select all columns from the table, use a * symbol instead of column names. However, there might be duplicate entries because SQL allows duplicates in relations as well as query results. Using the DISTINCT keyword, we can access distinct (different) values.
#### Syntax:
```
 SELECT "column_name" FROM "table_name"
 SELECT * FROM "table_name"
 SELECT DISTINCT "column_name" FROM "table_name"
```

## **SELECT Statement Examples**

```
# Select all tuples from course relation
# An Asterisk(*) in the select clause denotes all attributes

sql> SELECT * FROM course;
```
| course_id | course_name | course_length|	
| - | - | - |
| 1 |	Fundamentals of Computer Science | 3	|
| 2	| Fundamentals of Mathematics |	4	
| 3	| Machine Learning |	5	
| 4	| Deep Learning |	5	
| 5	| Computer Vision |	5	
| 6	| Natural Language Processing	| 5

In [ ]:
%sql  SELECT * FROM course;

 * sqlite://
Done.

[(1, 'Fundamentals of Computer Science', 3),
 (2, 'Fundamentals of Mathematics', 3),
 (3, 'Machine Learning', 3),
 (4, 'Deep Learning', 3),
 (5, 'Computer Vision', 3),
 (6, 'Natural Language Processing', 3)]

```
# Select all tuples form module where course_id = 1

sql> SELECT * FROM module WHERE course_id = 1;
```

| course_id |	module_num | module_name |
| - | - | - |
| 1 |	1 |	Introduction to the Course |
| 1	| 2	| Basics of Computer Systems |	
| 1	| 3	| Python Programming |
| 1	| 4	| Data Structures and Algorithms |	
| 1	| 5	| Database |	
| 1	| 6	| Building Applications |

```
# Select all tuples from a unit of course_id = 1 and module_num = 2

sql> SELECT * FROM unit WHERE course_id = 1 AND module_num = 2
```

| course_id | module_num | unit_num | unit_name | time_allotted | 
| - | - | - | - | - |
| 1 | 2	| 1	| Introduction to the Module | 0 |
| 1	| 2	| 2	| Digital Information & Digital Logic	| 1.25 |	
| 1	| 2	| 3	| Basics Computer Architecture	| 2 |	
| 1	| 2	| 4	| Basics of Linux Operating System	| 1.5 |	
| 1	| 2	| 5	| Basics of Computer Networks	| 1.5	|
| 1	| 2	| 6	| Module Summary	| 0	|

```
# Select only unit name and time allotted for a unit of first course second module
sql> SELECT unit_name, time_allotted FROM unit WHERE course_id = 1 AND module_num = 2;
```

| unit_name | time_allotted	| 
| - | - |
| Introduction to the Module | 0 | 
| Digital Information & Digital Logic | 1.25 | 
| Basics Computer Architecture	| 2	| 
| Basics of Linux Operating System	| 1.5	| 
| Basics of Computer Networks	| 1.5	| 
| Module Summary	| 0	|

```
# Display name  of courses whose course length is between 3 to 4 months

sql> SELECT course_name FROM course WHERE course_length BETWEEN 3 AND 4
```

| course_name |
| - |	
| Fundamentals of Computer Science |	
| Fundamentals of Mathematics	|

```
# A select clause can contain arithmetic expression involving +,-,*,/ operations 
# can rename using 'as' clause(alias)

sql> SELECT course_name, course_length*4 AS course_length_in_weeks FROM course
```

| course_name	| course_length_in_weeks | 
| - | - |
| Fundamentals of Computer Science	| 12 | 	
| Fundamentals of Mathematics	| 16 | 
| Machine Learning	| 20 | 
| Deep Learning	| 20 | 
| Computer Vision	| 20 | 	
| Natural Language Processing	| 20 |

```
# List out the assignment names of all the assignments that have high weightage(greater than 100 marks)

sql> SELECT * FROM assignment WHERE assignment_marks > 100
```

| course_id	| module_num	| unit_num	| assignment_name	| assignment_marks | 
| - | - | - | - | - |
| 2	| 2	| 7	| Eigen Faces	| 110 | 	
| 2	| 3	| 7	| N/A	| 110	|

```
# List out all project with their respective module name

sql> SELECT module_name, project_title FROM  module, project WHERE
(module.course_id, module.module_num) = (project.course_id, project.module_num)
```

| module_name	| project_title	| 
| - | - |
| Introduction to the Course	| None | 	
| Linear Algebra	| 3D Reconstruction	| 
| Calculus	| Shape Optimization	|

SQL includes a string matching operator for comparisions on character string.
* percent(%) character matches and substring
* underscore(_) matches any character

```
# Find the name of all courses that are Fundamental(have Fundamental in their name)

sql> SELECT * FROM course WHERE course_name LIKE '%Fundamental%'
```

| course_id	| course_name	| course_length	| 
| - | - | - | 
|  1	| Fundamentals of Computer Science	| 3	| 
| 2	| Fundamentals of Mathematics	| 4	|

```
# Students of fusemachines from Nepal have country domain .np in their email id. For Example: buddha@fusemachines.com.np
# List down all the students from Nepal.

sql> SELECT * FROM student WHERE student_email LIKE '%.np%'
```

| student_id | student_name | student_email | student_contact | date_joined | 
| - | - | - | - | - | 	
| 4	| Harka Bahadur	| harke@fusemachines.com.np | NULL | 2019-11-13 10:29:15 | 	
| 5	| Ful Kumari | fulkumari@fusemachines.com.np | NULL | 2019-11-13 10:29:15	| 
| 7	| Bir Kaji Sherchan	| birkaji@fusemachines.com.np	| NULL | 2019-11-13 10:29:15 | 
| 8	| Maiya Gauchan	| maiya@fusemachines.com.np	| NULL | 2019-11-13 10:29:15 |

> Ordering the display of tuples:
* Optionally, specify ASC for Ascending order
* Specify DESC for Descending order 

```
# List in alphabetic order the name of all students

sql> SELECT student_name FROM student ORDER BY student_name
```

| student_name | 
| - | 	
| Alison Burgers	| 
| Bir Kaji Sherchan	| 
| Chulbul Pandey | 	
| Dummy Person | 	
| Ful Kumari | 	
| Harka Bahadur | 	
| John Doe | 
| Maiya Gauchan |